doors-factory/ssl/Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<BasedOn>
				<xr:Item>Document.Производство</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Накладная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

doors-factory/ssl/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

doors-factory/ssl/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Заказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

doors-factory/ssl/Documents/Реализация/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)     
	
	// Проверка типа документа
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Производство") Тогда
		
		// Получаем документ ЗаказПокупателя, связанный с текущим Производством      
		Заказ = ДанныеЗаполнения.Заказ;
		ЗаказПокупателя = ДанныеЗаполнения.Заказ;                
		Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
			// Запрос для получения позиций из табличной части "ПереченьТоваров" документа ЗаказПокупателя
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|   Товары.Название КАК Название,
			|   Товары.Цена КАК Цена,
			|   Товары.Сумма КАК Сумма
			|ИЗ
			|   Документ.ЗаказПокупателя.ПереченьТоваров КАК Товары
			|ГДЕ
			|   Товары.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя);
			
			// Выполняем запрос
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаЗаказПокупателя = РезультатЗапроса.Выгрузить();
			// Заполнение таблицы из Производства
			Для Каждого ТекСтрокаПроизведенныеДвери Из ДанныеЗаполнения.ПроизведенныеДвери Цикл
				// Добавляем новую строку в Накладную
				НоваяСтрока = Накладная.Добавить();
				НоваяСтрока.Количество = ТекСтрокаПроизведенныеДвери.Количество;
				НоваяСтрока.Название = ТекСтрокаПроизведенныеДвери.Название;
				НоваяСтрока.Размер = ТекСтрокаПроизведенныеДвери.Размер;
				НоваяСтрока.Цвет = ТекСтрокаПроизведенныеДвери.Цвет;
				
				// Поиск соответствующей позиции в ПереченьТоваров ЗаказаПокупателя по полю "Название"
				СтрокаЗаказа = ТаблицаЗаказПокупателя.Найти(ТекСтрокаПроизведенныеДвери.Название, "Название");
				
				Если СтрокаЗаказа <> Неопределено Тогда
					// Заполняем цену и сумму, если найдена соответствующая строка
					НоваяСтрока.Цена = СтрокаЗаказа.Цена;
					НоваяСтрока.Сумма = СтрокаЗаказа.Сумма;
				КонецЕсли;
			КонецЦикла;  
		КонецЕсли;
	КонецЕсли;      
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
	
	// Выбираем все документы "ЗаказПокупателя" из базы данных
	ЗаказыПокупателей = Документы.ЗаказПокупателя.Выбрать();
	
	// Начинаем цикл по всем заказам покупателей
	Пока ЗаказыПокупателей.Следующий() Цикл
		// Проверяем, соответствует ли текущий заказ тому, который мы хотим провести
		Если ЗаказыПокупателей.Ссылка = Заказ Тогда   
			// Получаем объект текущего заказа покупателя
			ЗакПокРек = ЗаказыПокупателей.ПолучитьОбъект();   
			
			// Проверяем статус заказа
			Если ЗакПокРек.Статус <> Перечисления.СтатусыЗаказов.Выполнен Тогда
				// Если статус не "Выполнен", выводим сообщение об ошибке
				Сообщить("Документ не может быть проведен, т.к товар еще не готов");
				Отказ = Истина; // Устанавливаем флаг отказа
				Возврат;      // Завершаем выполнение процедуры
			ИначеЕсли ЗакПокРек.Статус = Перечисления.СтатусыЗаказов.Выдан Тогда
				// Если статус "Выдан", выводим соответствующее сообщение
				Сообщить("Документ не может быть проведен, т.к товар уже выдан."); 
				Отказ = Истина; // Устанавливаем флаг отказа
				Возврат;     // Завершаем выполнение процедуры
			ИначеЕсли ЗакПокРек.СтатусОплаты <> Перечисления.СтатусыЗаказов.Оплачен Тогда
				// Если заказ не оплачен, выводим сообщение об этом
				Сообщить("Документ не может быть проведен, т.к товар еще не оплачен"); 
				Отказ = Истина; // Устанавливаем флаг отказа
				Возврат; // Завершаем выполнение процедуры
			КонецЕсли;
			
			// Если все проверки пройдены, обновляем статус заказа
			ЗакПокРек.Статус = Перечисления.СтатусыЗаказов.Выдан;
			ЗакПокРек.ДатаВыдачи = Дата;   // Устанавливаем дату выдачи
			ЗакПокРек.Записать();     // Сохраняем изменения в заказе
		КонецЕсли;
	КонецЦикла; // Завершаем цикл по заказам покупателей
	
	// Записываем изменения в документ с учетом режима проведения
	ЗакПокРек.Записать(РежимЗаписиДокумента.Проведение);   
	
КонецПроцедуры
